czaloom/EmbeddedML/EmbeddedML_Orientation 2/Drivers/BSP/Components/stc3115/STC3115_Driver.c
/**
  ******************************************************************************
  * @file    STC3115_Driver.c
  * @author  Central Labs
  * @version V1.0.0
  * @date    07-October-2014
  * @brief   STC3115 Driver Component Function Vector
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2014 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "STC3115_Driver.h"
#include "STC3115_Battery.h"

/** @addtogroup BSP
  * @{
  */

/** @addtogroup Components
  * @{
  */

/** @addtogroup STC3115
  * @brief      Provides a set of functions to drive STMicroelectronics STC3115 Gas Gauge device
  * @{
  */

/** @defgroup STC3115_Private_TypesDefinitions
  * @{
  */

/**
  * @}
  */

/** @defgroup STC3115_Private_Macros
  * @{
  */

/**
  * @}
  */

/** @defgroup STC3115_Private_FunctionPrototypes
  * @{
  */
static DrvStatusTypeDef STC3115_Init( DrvContextTypeDef* );

static DrvStatusTypeDef STC3115_DeInit( DrvContextTypeDef *handle );
//static DrvStatusTypeDef STC3115_Sensor_Enable( DrvContextTypeDef *handle );
//static DrvStatusTypeDef STC3115_Sensor_Disable( DrvContextTypeDef *handle );
static DrvStatusTypeDef STC3115_Get_WhoAmI( DrvContextTypeDef *handle, uint8_t *who_am_i );

static DrvStatusTypeDef STC3115_Task( DrvContextTypeDef* , uint8_t *vm_mode);
static DrvStatusTypeDef STC3115_Reset( DrvContextTypeDef* );
static DrvStatusTypeDef STC3115_Stop( DrvContextTypeDef* );
static DrvStatusTypeDef STC3115_GetSOC( DrvContextTypeDef*, uint32_t*  );
static DrvStatusTypeDef STC3115_GetOCV( DrvContextTypeDef*, uint32_t*  );
static DrvStatusTypeDef STC3115_GetCurrent( DrvContextTypeDef*, int32_t*  );
static DrvStatusTypeDef STC3115_GetTemperature( DrvContextTypeDef*, int32_t*  );
static DrvStatusTypeDef STC3115_GetVoltage( DrvContextTypeDef*, uint32_t*  );
static DrvStatusTypeDef STC3115_GetChargeValue( DrvContextTypeDef*, uint32_t*  );
static DrvStatusTypeDef STC3115_GetPresence( DrvContextTypeDef*, uint32_t*  );
static DrvStatusTypeDef STC3115_GetAlarmStatus( DrvContextTypeDef*, uint32_t*  );

extern uint8_t Sensor_IO_Write( void *handle, uint8_t WriteAddr, uint8_t *pBuffer, uint16_t nBytesToWrite );
extern uint8_t Sensor_IO_Read( void *handle, uint8_t ReadAddr, uint8_t *pBuffer, uint16_t nBytesToRead );

static int STC3115_Read(DrvContextTypeDef* handle, uint8_t RegAddress, uint8_t *data, uint16_t NumByteToRead);
static int STC3115_Write(DrvContextTypeDef* handle, uint8_t RegAddress, uint8_t *data, uint16_t NumByteToWrite);
static int STC3115_ReadWord(DrvContextTypeDef* handle, uint8_t RegAddress, int* value);
static int STC3115_WriteWord(DrvContextTypeDef* handle, uint8_t RegAddress, int value);
static int STC3115_Status( DrvContextTypeDef* handle );
static int STC3115_ReadRamData(DrvContextTypeDef* handle, unsigned char *RamData);
static int STC3115_WriteRamData(DrvContextTypeDef* handle, unsigned char *RamData);
static int STC3115_CalcRamCRC8(unsigned char *data, int n);
static int STC3115_UpdateRamCRC(DrvContextTypeDef* handle);
static void STC3115_InitRamData(DrvContextTypeDef* handle, STC3115_ConfigData_TypeDef *ConfigData);
static int STC3115_Restore(DrvContextTypeDef* handle, STC3115_ConfigData_TypeDef *ConfigData);
static int STC3115_Powerdown(DrvContextTypeDef* handle);
static int STC3115_conv(short value, unsigned short factor);
static int STC3115_Startup(DrvContextTypeDef* handle, STC3115_ConfigData_TypeDef *ConfigData);
static int STC3115_ReadBatteryData(DrvContextTypeDef* handle, STC3115_BatteryData_TypeDef *BatteryData);

static DrvStatusTypeDef STC3115_SetParam(DrvContextTypeDef* handle, STC3115_ConfigData_TypeDef *ConfigData);

#define GG_Delay HAL_Delay
extern void HAL_Delay(int delay);

/**
* @}
*/

/** @defgroup STC3115_Private_Variables
  * @{
  */
GG_Drv_t   STC3115_Drv =
{
  .Init = STC3115_Init,
  
  .DeInit = STC3115_DeInit,
  .Sensor_Enable = 0,
  .Sensor_Disable = 0,
  .Get_WhoAmI = STC3115_Get_WhoAmI,
  
  .Task = STC3115_Task,
  .Reset = STC3115_Reset,
  .Stop = STC3115_Stop,
  
  .GetSOC = STC3115_GetSOC,
  .GetOCV = STC3115_GetOCV,
  .GetCurrent = STC3115_GetCurrent,
  .GetTemperature = STC3115_GetTemperature,
  .GetVoltage = STC3115_GetVoltage,
  .GetChargeValue = STC3115_GetChargeValue,
  .GetPresence = STC3115_GetPresence,
  .GetAlarmStatus = STC3115_GetAlarmStatus,
  .GetITState = 0,
  
  .AlarmSetVoltageThreshold = 0,
  .AlarmSetSOCThreshold = 0,
  
  .GetIT = 0,
  .SetIT = 0,
  .StopIT = 0,
  .ClearIT = 0,
};

/**
* @}
*/


/** @defgroup STC3115_Private_Functions
  * @{
  */

/**
 * @brief Initializes STC3115 Gas Gauge. Hides low level device and battery details
 * @param None
 * @retval None
 */
static DrvStatusTypeDef STC3115_Init( DrvContextTypeDef* handle )
{
  int32_t res, loop;
  int32_t OCVOffset[16] = OCV_OFFSET_TAB;
  int vcount = 0;
  uint8_t res8;
  
  STC3115_ConfigData_TypeDef *ConfigData = &(( STC3115_Data_t * )(( GG_Data_t * )handle->pData)->pComponentData)->configData;
  STC3115_BatteryData_TypeDef *BatteryData = &(( STC3115_Data_t * )(( GG_Data_t * )handle->pData)->pComponentData)->batteryData;
  RAMData_TypeDef *RAMData = &(( STC3115_Data_t * )(( GG_Data_t * )handle->pData)->pComponentData)->ramData;
  
  /*** Fill configuration structure parameters ***/
  ConfigData->Vmode = VMODE;
  
  if(RSENSE != 0)
  {
    ConfigData->Rsense = RSENSE;
  }
  else
  {
    ConfigData->Rsense = 10; // default value to avoid division by 0
  }
  
  ConfigData->CC_cnf = (CAPACITY * ConfigData->Rsense * 250 + 6194) / 12389;
  
  if(RINT != 0)
  {
    ConfigData->VM_cnf = (CAPACITY * RINT * 50 + 24444) / 48889;
  }
  else
  {
    ConfigData->VM_cnf = (CAPACITY * 200 * 50 + 24444) / 48889; // default value
  }
  
