czaloom/EmbeddedML/EmbeddedML_Orientation 2/Drivers/BSP/Components/stc3115/STC3115_Driver.c
  for(loop = 0; loop < 16; loop++)
  {
    if(OCVOffset[loop] > 127)
    {
      OCVOffset[loop] = 127;
    }
    if(OCVOffset[loop] < -127)
    {
      OCVOffset[loop] = -127;
    }
    ConfigData->OCVOffset[loop] = OCVOffset[loop];
  }
  
  ConfigData->Cnom = CAPACITY;
  ConfigData->RelaxCurrent = CAPACITY / 20;
  
  ConfigData->Alm_SOC = ALM_SOC;
  ConfigData->Alm_Vbat = ALM_VBAT;
  
  /*** Initialize Gas Gauge system ***/
  
  /* check STC3115 status */
  res = STC3115_Status(handle);
  if(res < 0)
  {
    return COMPONENT_ERROR;
  }
    
  /*Battery presence status init*/
  BatteryData->Presence = 1;
  
  /* check RAM data validity */
  STC3115_ReadRamData(handle, RAMData->db);
  
  STC3115_Read(handle, STC3115_REG_MODE, &res8, 1);
  res8 &= STC3115_GG_RUN;
  if(res8 != 0)   /* GasGauge is running */
  {
    STC3115_Read(handle, STC3115_REG_CTRL, &res8, 1);
    res8 &= (STC3115_BATFAIL | STC3115_PORDET);
    if(res8 == 0)   /* no GG reset has occurred */
    {
      if((RAMData->reg.TstWord == RAM_TSTWORD) && (STC3115_CalcRamCRC8(RAMData->db, RAM_SIZE) == 0))  /* RAM data is consistent */
      {
        if(RAMData->reg.STC3115_Status == STC3115_RUNNING)   /* last saved RAM state was for a valid measurement */
        {
          /* Recover from last SOC */
          res = STC3115_Restore(handle, ConfigData);
          if(res < 0)
            return COMPONENT_ERROR;
        }
      }
    }
  }
  
  /* Startup from known state */
  STC3115_Reset(handle);
  STC3115_InitRamData(handle, ConfigData);
  
  RAMData->reg.STC3115_Status = STC3115_INIT;
  STC3115_UpdateRamCRC(handle);
  STC3115_WriteRamData(handle, RAMData->db);
  
  /* Configure & Handle delays and Resets */
  STC3115_SetParam(handle, ConfigData);
  
  STC3115_ReadWord(handle, STC3115_REG_COUNTER, &vcount);
  while(vcount <= VCOUNT)
  {
    STC3115_Read(handle, STC3115_REG_MODE, &res8, 1);
    res8 &= STC3115_GG_RUN;
    while(res8 == 0)
    {
      STC3115_SetParam(handle, ConfigData);
      GG_Delay(200);
      STC3115_Read(handle, STC3115_REG_MODE, &res8, 1);
      res8 &= STC3115_GG_RUN;
    } 
    GG_Delay(200);
    STC3115_ReadWord(handle, STC3115_REG_COUNTER, &vcount);
  }
  
  handle->isInitialized = 1;
  return COMPONENT_OK;
}


/**
 * @brief Deinitialize the STC3115 sensor
 * @param handle the device handle
 * @retval COMPONENT_OK in case of success
 * @retval COMPONENT_ERROR in case of failure
 */
static DrvStatusTypeDef STC3115_DeInit( DrvContextTypeDef *handle )
{
  handle->isInitialized = 0;

  return COMPONENT_OK;
}


/**
 * @brief Enable the  STC3115 sensor
 * @param handle the device handle
 * @retval COMPONENT_OK in case of success
 * @retval COMPONENT_ERROR in case of failure
 */
//static DrvStatusTypeDef STC3115_Sensor_Enable( DrvContextTypeDef *handle )
//{
//  return COMPONENT_NOT_IMPLEMENTED;
//}


/**
 * @brief Disable the STC3115 sensor
 * @param handle the device handle
 * @retval COMPONENT_OK in case of success
 * @retval COMPONENT_ERROR in case of failure
 */
//static DrvStatusTypeDef STC3115_Sensor_Disable( DrvContextTypeDef *handle )
//{
//  return COMPONENT_NOT_IMPLEMENTED;
//}

/**
 * @brief Get the WHO_AM_I ID of the STC3115 sensor
 * @param handle the device handle
 * @param who_am_i pointer to the value of WHO_AM_I register
 * @retval COMPONENT_OK in case of success
 * @retval COMPONENT_ERROR in case of failure
 */
static DrvStatusTypeDef STC3115_Get_WhoAmI( DrvContextTypeDef *handle, uint8_t *who_am_i )
{
  if (STC3115_Read(handle, STC3115_REG_ID, who_am_i, 1) == 0)
  {
    return COMPONENT_OK;
  }
  else
  {
    return COMPONENT_ERROR;
  }
}


/**
 * @brief Task function for STC3115 Gas Gauge. Hides low level device and battery details
 * @param None
 * @retval Same as GasGauge_Task
 */
static DrvStatusTypeDef STC3115_Task( DrvContextTypeDef* handle, uint8_t *vm_mode)
{
  int res;

  STC3115_ConfigData_TypeDef *ConfigData = &(( STC3115_Data_t * )(( GG_Data_t * )handle->pData)->pComponentData)->configData;
  STC3115_BatteryData_TypeDef *BatteryData = &(( STC3115_Data_t * )(( GG_Data_t * )handle->pData)->pComponentData)->batteryData;
  RAMData_TypeDef *RAMData = &(( STC3115_Data_t * )(( GG_Data_t * )handle->pData)->pComponentData)->ramData;
  
  /* ----------------------------- System state verification ---------------------------- */
  /*Read STC3115 status registers */
  res = STC3115_Status(handle);
  
  if (res < 0) return(COMPONENT_ERROR); /* return if I2C error or STC3115 not responding */
  BatteryData->status = res;
  
  /* check STC3115 RAM status (battery has not been changed) */
  STC3115_ReadRamData(handle, RAMData->db);
  if ( (RAMData->reg.TstWord != RAM_TSTWORD) || (STC3115_CalcRamCRC8(RAMData->db, RAM_SIZE) != 0) )
  {
    /* if RAM non ok, reset it and set init state */
    STC3115_InitRamData(handle, ConfigData);
    RAMData->reg.STC3115_Status = STC3115_INIT;
  }
  
  /* check battery presence status */
  if ((BatteryData->status & (STC3115_BATFAIL << 8)) != 0)
  {
    /*Battery disconnection has been detected     */
    
    /*BATD pin level is over 1.61 or Vcc is below 2.7V  */
    BatteryData->Presence = 0;
    
    /*HW and SW state machine reset*/
    STC3115_Reset(handle);
    
    return (COMPONENT_ERROR);
  }
  
  /* check STC3115 running mode*/
  if ((BatteryData->status & STC3115_GG_RUN) == 0)
  {
    if(RAMData->reg.STC3115_Status == STC3115_RUNNING)
    {
      STC3115_Restore(handle, ConfigData);  /* if RUNNING state, restore STC3115*/
    }
    else
    {
      STC3115_Startup(handle, ConfigData);  /* if INIT state, initialize STC3115*/
    }
    
    RAMData->reg.STC3115_Status = STC3115_INIT;
  }
  
  /* --------------------------------- Read battery data ------------------------------- */
  
  res = STC3115_ReadBatteryData(handle, BatteryData);
  if (res != 0) return(COMPONENT_ERROR); /* abort in case of I2C failure */
  
  
  /* ------------------------------- battery data report ------------------------------- */
  /* check INIT state */
  if (RAMData->reg.STC3115_Status == STC3115_INIT)
  {
    /* INIT state, wait for current & temperature value available: */
    if (BatteryData->ConvCounter > VCOUNT)
    {
      RAMData->reg.STC3115_Status = STC3115_RUNNING;
      /*Battery is connected*/
      BatteryData->Presence = 1;
    }
  }
  
  if (RAMData->reg.STC3115_Status != STC3115_RUNNING)   /* not running : data partially availalble*/
  {
    BatteryData->ChargeValue = ConfigData->Cnom * BatteryData->SOC / MAX_SOC;
    BatteryData->Current = 0;
    BatteryData->Temperature = 250;
    BatteryData->RemTime = -1;
  }
  else /*STC3115 running */
  {
  
    /* ---------- process SW algorithms -------- */
    
