czaloom/EmbeddedML/EmbeddedML_Orientation 2/Drivers/BSP/Components/stc3115/STC3115_Driver.c
    /*early empty compensation*/
    if (BatteryData->Voltage < APP_CUTOFF_VOLTAGE)
      BatteryData->SOC = 0;
    else if (BatteryData->Voltage < (APP_CUTOFF_VOLTAGE + 200))
      BatteryData->SOC = BatteryData->SOC * (BatteryData->Voltage - APP_CUTOFF_VOLTAGE) / 200;
      
    /* Battery charge value calculation */
    
    BatteryData->ChargeValue = ConfigData->Cnom * BatteryData->SOC / MAX_SOC;
    
    if ((BatteryData->status & STC3115_VMODE) == 0) /* mixed mode only*/
    {
    
      /*Lately fully compensation*/
      if ((BatteryData->status & STC3115_VMODE) == 0) /*running in mixed mode*/
      {
      
        if(BatteryData->Current > APP_EOC_CURRENT && BatteryData->SOC > 990)
        {
          BatteryData->SOC = 990;
          STC3115_WriteWord(handle, STC3115_REG_SOC, 50688);  /* 99% */
        }
      }
      
      /*Remaining time calculation*/
      if(BatteryData->Current < 0)
      {
      
        BatteryData->RemTime = (BatteryData->RemTime * 4 + BatteryData->ChargeValue / BatteryData->Current * 60 ) / 5;
        if( BatteryData->RemTime  < 0)
          BatteryData->RemTime = -1; /* means no estimated time available */
      }
      else
        BatteryData->RemTime = -1; /* means no estimated time available */
        
    }
    else /* voltage mode only */
    {
      BatteryData->Current = 0;
      BatteryData->RemTime = -1;
    }
    
    //SOC min/max clamping
    if(BatteryData->SOC > 1000) BatteryData->SOC = MAX_SOC;
    if(BatteryData->SOC < 0) BatteryData->SOC = 0;
    
  }
  /* save SOC */
  RAMData->reg.HRSOC = BatteryData->HRSOC;
  RAMData->reg.SOC = (BatteryData->SOC + 5) / 10;
  STC3115_UpdateRamCRC(handle);
  STC3115_WriteRamData(handle, RAMData->db);
  
  if (RAMData->reg.STC3115_Status == STC3115_RUNNING)
  {
    if((BatteryData->status & (STC3115_GG_VM << 8)) == 0)
      *vm_mode=MIXED_MODE; //return(2); // Coulomb counter mode
    else
      *vm_mode=VM_MODE; //return(1); // Voltage mode
  }
  return COMPONENT_OK;
}

/**
 * @brief Resets Gas Gauge
 * @param None
 * @retval None
 */
static DrvStatusTypeDef STC3115_Reset(DrvContextTypeDef* handle)
{
  int res;
  RAMData_TypeDef *RAMData = &(( STC3115_Data_t * )(( GG_Data_t * )handle->pData)->pComponentData)->ramData;
  
  /* reset RAM */
  RAMData->reg.TstWord = 0;
  RAMData->reg.STC3115_Status = 0;
  res = STC3115_WriteRamData(handle, RAMData->db);
  if(res != OK) return COMPONENT_ERROR;
  /* reset STC3115*/
  uint8_t data = STC3115_PORDET;
  res = STC3115_Write(handle, STC3115_REG_CTRL, &data, 1);  /*   set soft POR */
  
  return COMPONENT_OK;
}

/**
 * @brief Stops Gas Gauge
 * @param None
 * @retval Same as GasGauge_Stop
 */
static DrvStatusTypeDef STC3115_Stop(DrvContextTypeDef* handle)
{
  int res;
  RAMData_TypeDef *RAMData = &(( STC3115_Data_t * )(( GG_Data_t * )handle->pData)->pComponentData)->ramData;
  
  /*Save context in RAM*/
  STC3115_ReadRamData(handle, RAMData->db);
  RAMData->reg.STC3115_Status = STC3115_POWERDN;
  /* update the crc */
  STC3115_UpdateRamCRC(handle);
  STC3115_WriteRamData(handle, RAMData->db);
  
  /*STC3115 Power down*/
  res = STC3115_Powerdown(handle);
  if (res != 0) return (COMPONENT_ERROR); /* error */
  
  return(COMPONENT_OK);
}

/**
 * @brief Returns battery State of Charge
 * @param None
 * @retval Battery State of Charge value
 */
static DrvStatusTypeDef STC3115_GetSOC( DrvContextTypeDef* handle, uint32_t* SOC)
{
  *SOC = ((( STC3115_Data_t * )(( GG_Data_t * )handle->pData)->pComponentData)->batteryData.SOC + 5) / 10;
  return COMPONENT_OK;
}

/**
 * @brief Returns battery Open circuit Voltage
 * @param None
 * @retval Open circuit Voltage value
 */
static DrvStatusTypeDef STC3115_GetOCV(DrvContextTypeDef* handle, uint32_t* OCV)
{
  *OCV = (( STC3115_Data_t * )(( GG_Data_t * )handle->pData)->pComponentData)->batteryData.OCV;
  return COMPONENT_OK;
}

/**
 * @brief Returns absorbed current
 * @param None
 * @retval Current value
 */
static DrvStatusTypeDef STC3115_GetCurrent(DrvContextTypeDef* handle, int32_t* Current)
{
  *Current = (( STC3115_Data_t * )(( GG_Data_t * )handle->pData)->pComponentData)->batteryData.Current;
  return COMPONENT_OK;
}

/**
 * @brief Returns temperature value
 * @param None
 * @retval Temperature value
 */
static DrvStatusTypeDef STC3115_GetTemperature(DrvContextTypeDef* handle, int32_t* Temperature)
{
  *Temperature = (( STC3115_Data_t * )(( GG_Data_t * )handle->pData)->pComponentData)->batteryData.Temperature;
  return COMPONENT_OK;
}

/**
 * @brief Returns battery voltage
 * @param None
 * @retval Battery voltage value
 */
static DrvStatusTypeDef STC3115_GetVoltage(DrvContextTypeDef* handle, uint32_t* Voltage)
{
  *Voltage = (( STC3115_Data_t * )(( GG_Data_t * )handle->pData)->pComponentData)->batteryData.Voltage;
  return COMPONENT_OK;
}

/**
 * @brief Returns remaining battery charge value
 * @param None
 * @retval battery charge value
 */
static DrvStatusTypeDef STC3115_GetChargeValue(DrvContextTypeDef* handle, uint32_t* ChargeValue)
{
  *ChargeValue = (( STC3115_Data_t * )(( GG_Data_t * )handle->pData)->pComponentData)->batteryData.ChargeValue;
  return COMPONENT_OK;
}

/**
 * @brief Tells whether battery is present or not
 * @param None
 * @retval 0 if battery is not present, 1 if present
 */
static DrvStatusTypeDef STC3115_GetPresence(DrvContextTypeDef* handle, uint32_t* Presence)
{
  *Presence = (( STC3115_Data_t * )(( GG_Data_t * )handle->pData)->pComponentData)->batteryData.Presence;
  return COMPONENT_OK;
}

/**
 * @brief Returns Alarm bits status
 * @param None
 * @retval STC3115 Alarm bits status
 */
static DrvStatusTypeDef STC3115_GetAlarmStatus(DrvContextTypeDef* handle, uint32_t* status)
{
  *status = ((( STC3115_Data_t * )(( GG_Data_t * )handle->pData)->pComponentData)->batteryData.status >> 13) & 0x3;
  return COMPONENT_OK;
}

/**
 * @brief Read the STC3115 status
 * @param None
 * @retval status word (REG_MODE / REG_CTRL), -1 if error
 */
static int STC3115_Status( DrvContextTypeDef* handle )
{
  int value;
  uint8_t data;
  
