czaloom/EmbeddedML/EmbeddedML_Orientation 2/Drivers/BSP/Components/stc3115/STC3115_Driver.c
  /* First, check the presence of the STC3115 by reading first byte of dev. ID */
  if(STC3115_Read(handle, STC3115_REG_ID, &data, 1) == -1)
    return -1;
  if (data != STC3115_ID)
    return -1;
    
  /* read REG_MODE and REG_CTRL */
  STC3115_ReadWord(handle, STC3115_REG_MODE, &value);
  value &= 0x7f7f;
  
  return value;
}

/**
 * @brief Calculate the CRC8
 * @param pointer to byte array,
 * @param n: number of bytes
 * @retval CRC value
 */
static int STC3115_CalcRamCRC8(unsigned char *data, int n)
{
  int crc = 0; /* initial value */
  int i, j;
  
  for (i = 0; i < n; i++)
  {
    crc ^= data[i];
    for (j = 0; j < 8; j++)
    {
      crc <<= 1;
      if (crc & 0x100)  crc ^= 7;
    }
  }
  return(crc & 255);
}


/**
 * @brief calculate the RAM CRC
 * @param None
 * @retval CRC value
 */
static int STC3115_UpdateRamCRC( DrvContextTypeDef* handle )
{
  int res;
  RAMData_TypeDef *RAMData = &(( STC3115_Data_t * )(( GG_Data_t * )handle->pData)->pComponentData)->ramData;
  
  res = STC3115_CalcRamCRC8(RAMData->db, RAM_SIZE - 1);
  RAMData->db[RAM_SIZE - 1] = res; /* last byte holds the CRC */
  return(res);
}


/**
 * @brief Initialize the STC3115 RAM registers with valid test word and CRC
 * @param ConfigData Pointer to STC3115_ConfigData_TypeDef structure
 * @retval None
 */
static void STC3115_InitRamData(DrvContextTypeDef* handle, STC3115_ConfigData_TypeDef *ConfigData)
{
  int index;
  RAMData_TypeDef *RAMData = &(( STC3115_Data_t * )(( GG_Data_t * )handle->pData)->pComponentData)->ramData;
  
  //Set full RAM tab to 0
  for (index = 0; index < RAM_SIZE; index++)
  {
    RAMData->db[index] = 0;
  }
  //Fill RAM regs
  RAMData->reg.TstWord = RAM_TSTWORD; /* Fixed word to check RAM integrity */
  RAMData->reg.CC_cnf = ConfigData->CC_cnf;
  RAMData->reg.VM_cnf = ConfigData->VM_cnf;
  /* update the crc */
  STC3115_UpdateRamCRC(handle);
}


/**
 * @brief Utility function to write the RAM data into STC3115
 * @param RamData Pointer to read STC3115 RAM data array from
 * @retval I2C error code
 */
static int STC3115_WriteRamData(DrvContextTypeDef* handle, unsigned char *RamData)
{
  if (Sensor_IO_Write(handle, STC3115_REG_RAM, RamData, RAM_SIZE))
  {
    return -1;
  }
  else
  {
    return 0;
  }
}


/**
 * @brief utility function to read the RAM data from STC3115
 * @param RamData Pointer to store STC3115 RAM data array to
 * @retval I2C error code
 */
static int STC3115_ReadRamData(DrvContextTypeDef* handle, unsigned char *RamData)
{
  if (Sensor_IO_Read(handle, STC3115_REG_RAM, RamData, RAM_SIZE))
  {
    return -1;
  }
  else
  {
    return 0;
  }
}

/**
 * @brief Utility function to read the battery data from STC3115 to be called every 5s or so
 * @param Pointer to STC3115_BatteryData_TypeDef structure
 * @retval error status (OK, !OK)
 */
static int STC3115_ReadBatteryData(DrvContextTypeDef* handle, STC3115_BatteryData_TypeDef *BatteryData)
{
  unsigned char data[16];
  int res;
  int value;
  
  //STC3115_Read(DrvContextTypeDef* handle, uint8_t RegAddress, uint8_t *data, uint16_t NumByteToWrite)
  /* read STC3115 registers 0 to 14 */
  res = STC3115_Read(handle, 0, data, 15);
  
  if (res < 0) return(res); /* read failed */
  
  /* fill the battery status data */
  /* SOC */
  value = data[3];
  value = (value << 8) + data[2];
  BatteryData->HRSOC = value;     /* result in 1/512% */
  BatteryData->SOC = (value * 10 + 256) / 512; /* result in 0.1% */
  
  /* conversion counter */
  value = data[5];
  value = (value << 8) + data[4];
  BatteryData->ConvCounter = value;
  
  /* current */
  value = data[7];
  value = (value << 8) + data[6];
  value &= 0x3fff;   /* mask unused bits */
  if (value >= 0x2000) value = value - 0x4000; /* convert to signed value */
  BatteryData->Current = STC3115_conv(value, CurrentFactor / RSENSE); /* result in mA */
  
  /* voltage */
  value = data[9];
  value = (value << 8) + data[8];
  value &= 0x0fff; /* mask unused bits */
  if (value >= 0x0800) value -= 0x1000; /* convert to signed value */
  value = STC3115_conv(value, VoltageFactor); /* result in mV */
  BatteryData->Voltage = value;  /* result in mV */
  
  /* temperature */
  value = data[10];
  if (value >= 0x80) value -= 0x100; /* convert to signed value */
  BatteryData->Temperature = value * 10; /* result in 0.1°C */
  
  /* OCV */
  value = data[14];
  value = (value << 8) + data[13];
  value &= 0x3fff; /* mask unused bits */
  if (value >= 0x02000) value -= 0x4000; /* convert to signed value */
  value = STC3115_conv(value, VoltageFactor);
  value = (value + 2) / 4; /* divide by 4 with rounding */
  BatteryData->OCV = value;  /* result in mV */
  
  return(OK);
}

/**
 * @brief Restore STC3115 state
 * @param Pointer to STC3115 Configuration Data structure
 * @retval Always 0
 */
static int STC3115_Restore(DrvContextTypeDef* handle, STC3115_ConfigData_TypeDef *ConfigData)
{
  int res;
  RAMData_TypeDef *RAMData = &(( STC3115_Data_t * )(( GG_Data_t * )handle->pData)->pComponentData)->ramData;
  
  /* check STC310x status */
  res = STC3115_Status(handle);
  if (res < 0) return(res);
  
  STC3115_SetParam(handle, ConfigData);  /* set STC3115 parameters  */
  
  /* restore SOC from RAM data */
  res = 0;
  
  if (RAMData->reg.STC3115_Status == STC3115_RUNNING)
  {
    if (RAMData->reg.HRSOC != 0)
    {
      res = STC3115_WriteWord(handle, STC3115_REG_SOC, RAMData->reg.HRSOC);  /* restore HRSOC */
    }
  }
  return(res);
}

/**
 * @brief Stop the STC3115 at application power down
 * @param None
 * @retval Ok if success, error code otherwise
 */
static int STC3115_Powerdown(DrvContextTypeDef* handle)
{
  int res;
  uint8_t data;
  
  /* write 0x01 into the REG_CTRL to release IO0 pin open, */
  data = 0x01;
  STC3115_Write(handle, STC3115_REG_CTRL, &data, 1);
  
  /* write 0 into the REG_MODE register to put the STC3115 in standby mode */
  data = 0x00;
  res = STC3115_Write(handle, STC3115_REG_MODE, &data, 1);
  if (res!= OK) return (res);
  
  return (OK);
}

/**
 * @brief Convert a raw 16-bit value from STC3115 registers into user units (mA, mAh, mV, °C)
 * @param value 
 * @param factor 
 * @retval Converted value (result = value * factor / 4096)
 */
static int STC3115_conv(short value, unsigned short factor)
{
  int v;
  
