czaloom/EmbeddedML/EmbeddedML_Orientation 2/Drivers/BSP/Components/stc3115/STC3115_Driver.c
  v = ( (long) value * factor ) >> 11;
  v = (v+1)/2;
  
  return (v);
}

/**
 * @brief Initialize and start the STC3115 at application startup
 * @param Pointer to STC3115 Configuration Data structure
 * @retval 0 if ok, -1 if error
 */
static int STC3115_Startup(DrvContextTypeDef* handle, STC3115_ConfigData_TypeDef *ConfigData)
{
  int res;
  int ocv;
  
  /* check STC310x status */
  res = STC3115_Status(handle);
  if (res < 0) return(res);
  
  /* read OCV */
  STC3115_ReadWord(handle, STC3115_REG_OCV, &ocv);
  
  STC3115_SetParam(handle, ConfigData);  /* set STC3115 parameters  */
  
  /* rewrite ocv to start SOC with updated OCV curve */
  STC3115_WriteWord(handle, STC3115_REG_OCV, ocv);
  
  return 0;
}

/**
 * @brief Utility function to read the value stored in one register
 * @param  RegAddress STC3115 register to read
 * @param  value pointer to integer where to store data
 * @retval Error code: 0 ok, -1 error
 */
static int STC3115_Read(DrvContextTypeDef* handle, uint8_t RegAddress, uint8_t *data, uint16_t NumByteToRead)
{
  if (Sensor_IO_Read(handle, RegAddress, data, NumByteToRead))
  {
    return -1;
  }
  else
  {
    return 0;
  }
}

/**
 * @brief utility function to write a 8-bit value into a register
 * @param RegAddress STC3115 register
 * @param value value to write
 * @retval Error code: 0 ok, -1 error
 */
static int STC3115_Write(DrvContextTypeDef* handle, uint8_t RegAddress, uint8_t *data, uint16_t NumByteToWrite)
{
  if (Sensor_IO_Write(handle, RegAddress, data, NumByteToWrite))
  {
    return -1;
  }
  else
  {
    return 0;
  }
}

/**
 * @brief Utility function to read the value stored in one register pair
 * @param RegAddress STC3115 register
 * @param value pointer to integer value where to store data
 * @retval Error code: 0 ok, -1 error
 */
static int STC3115_ReadWord(DrvContextTypeDef* handle, uint8_t RegAddress, int* value)
{
  uint16_t tmp;
  
  if (Sensor_IO_Read(handle, RegAddress, (uint8_t*)&tmp, 2))
  {
    return -1;
  }
  else
  {
    *value = tmp & 0xffff;
    return 0;
  }
}


/**
 * @brief Utility function to write a 16-bit value into a register pair
 * @param RegAddress STC3115 register
 * @param value value to write
 * @retval Error code: 0 ok, -1 error
 */
static int STC3115_WriteWord(DrvContextTypeDef* handle, uint8_t RegAddress, int value)
{
  uint16_t tmp = value & 0xffff;
  
  if (Sensor_IO_Write(handle, RegAddress, (uint8_t*)&tmp, 2))
  {
    return -1;
  }
  else
  {
    return 0;
  }
}

/**
 * @brief Initialize the STC3115 parameters
 * @param ConfigData Pointer to STC3115 Configuration Data structure
 * @retval None
 */
static DrvStatusTypeDef STC3115_SetParam(DrvContextTypeDef* handle, STC3115_ConfigData_TypeDef *ConfigData)
{
  uint8_t data;
  RAMData_TypeDef *RAMData = &(( STC3115_Data_t * )(( GG_Data_t * )handle->pData)->pComponentData)->ramData;
  
  /* set GG_RUN=0 before changing algo parameters */
  data = STC3115_VMODE;
  STC3115_Write(handle, STC3115_REG_MODE, &data, 1);
  
  /* init OCV curve */
  STC3115_Write(handle, STC3115_REG_OCVTAB, (unsigned char *) ConfigData->OCVOffset, OCVTAB_SIZE);
  
  /* set alm level if different from default */
  if (ConfigData->Alm_SOC != 0 )
  {
    data = ConfigData->Alm_SOC * 2;
    STC3115_Write(handle, STC3115_REG_ALARM_SOC, &data, 1);
  }
  if (ConfigData->Alm_Vbat != 0 )
  {
    data = ((long)(ConfigData->Alm_Vbat << 9) / VoltageFactor); /* LSB=8*2.2mV */
    STC3115_Write(handle, STC3115_REG_ALARM_VOLTAGE, &data, 1);
  }
  
  /* relaxation timer */
  if (ConfigData->Rsense != 0 )
  {
    data = ((long)(ConfigData->RelaxCurrent << 9) / (CurrentFactor / ConfigData->Rsense));  /* LSB=8*5.88uV */
    STC3115_Write(handle, STC3115_REG_CURRENT_THRES, &data, 1);
  }
  
  /* set parameters if different from default, only if a restart is done (battery change) */
  if (RAMData->reg.CC_cnf != 0 ) STC3115_WriteWord(handle, STC3115_REG_CC_CNF, RAMData->reg.CC_cnf);
  if (RAMData->reg.VM_cnf != 0 ) STC3115_WriteWord(handle, STC3115_REG_VM_CNF, RAMData->reg.VM_cnf);
  
  data = 0x03;
  STC3115_Write(handle, STC3115_REG_CTRL, &data, 1); /*   clear PORDET, BATFAIL, free ALM pin, reset conv counter */
  
  data = STC3115_GG_RUN | (STC3115_VMODE * ConfigData->Vmode) | (STC3115_ALM_ENA * ALM_EN);
  STC3115_Write(handle, STC3115_REG_MODE, &data, 1);  /*   set GG_RUN=1, set mode, set alm enable */
  
  return COMPONENT_OK;
}

/**
* @}
*/

/**
* @}
*/

/**
* @}
*/

/**
* @}
*/

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/

